
# 1. Создайте пустой список `numbers`. Затем добавьте в этот список числа от 1 до 5 с помощью метода `append`.

# 2. Напишите программу, которая создает список `names` и добавляет в него ваши любимые имена (не менее трех) с помощью метода `append`.

# 3. Напишите программу для создания списка `grades`, куда вы добавите оценки по математике (например, 5, 4, 3) с помощью метода `append`.

# 4. Создайте пустой список `fruits`. Добавьте в этот список названия любимых фруктов с помощью метода `append`.

# 5. Напишите программу, которая создает список `cities` и добавляет в него названия городов, в которых вы были, с помощью метода `append`.

# 6. Создайте пустой список `animals`. Добавьте в него названия животных, которых вы знаете, с помощью метода `append`.

# 7. Напишите программу для создания списка `ages`, куда добавьте возрасты ваших друзей с помощью метода `append`.

# 8. Создайте список `books`, куда добавьте названия книг, которые вы прочитали, с помощью метода `append`.

# 9. Напишите программу, которая создает список `colors` и добавляет в него названия цветов радуги с помощью метода `append`.

# 10. Создайте пустой список `sports`. Добавьте в него названия ваших любимых видов спорта с помощью метода `append`.
