//??Создайте пустой массив numbers.
// ?Добавьте в этот массив числа от 1 до 5, используя только метод push.
// ?Удалите из массива первый элемент с помощью метода shift.
// ?Добавьте в массив число 6, используя метод push.
// ?Удалите из массива последний элемент с помощью метода pop.
// ?Выведите получившийся массив в консоль.

// ---------------------------------------------------------------------------
// !Task-2
// ?Создайте массив fruits с элементами "яблоко", "апельсин" и "банан".
// ?Удалите из массива первый элемент с помощью метода shift.
// ?Добавьте в массив "киви" с помощью метода push.
// ?Удалите из массива последний элемент с помощью метода pop.
// ?Выведите получившийся массив в консоль.

// -----------------------------------------------------------------------
// !Task-3
//? Создайте пустой массив names.
//? Добавьте в этот массив своё имя с помощью метода push.
//? Удалите из массива ваше имя с помощью метода shift.
//? Выведите получившийся массив в консоль.

// !Task-4
//? Создайте массив numbers и добавьте число 10 в начало массива, используя метод unshift. Затем выведите массив в консоль.
// let numbers = [20, 30, 40];
// ! Task-5
//? Удалите последний элемент из массива fruits и выведите его в консоль.
// let fruits = ["яблоко", "банан", "апельсин"];

// ! Task-6
// ?Создайте массив letters и добавьте в него букву Z в конец, используя метод push. Затем выведите массив в консоль.
// let letters = ['A', 'B', 'C'];
// ! Task-7
//? Удалите первый элемент из массива colors и выведите его в консоль.
let colors = ['red', 'green', 'blue', 'black']
// ! Task-8
// ?Создайте массив animals и добавьте в нем   слон, . Затем выведите массив в консоль.
// ! Task-9
//? Создайте массив letters с элементами "a", "b", "c", "d". Удалите первый элемент массива и выведите его на экран. Затем добавьте в конец массива элементы "x", "y", "z" с помощью метода push.
// * Ожидаемый результат: ["b", "c", "d", "x", "y", "z"]
// let letters = ["a", "b", "c", "d"];
// ! Task-10
// ?Создайте массив colors с элементами "красный" и "зеленый". Добавьте в начало массива "синий" с помощью метода unshift. Затем удалите последний элемент массива и выведите его на экран.
//* Ожидаемый результат: "зеленый"
// let colors = ["красный", "зеленый"];
