
# 1. **Что делает функция `get_word`?**

# 2. **Какие данные хранятся в каждом словаре внутри списка `words`? Назовите ключи.**

# 3. **Как программа выбирает слово для угадывания в функции `guess_the_word`?**

# 4. **Сколько попыток на угадывание слова дается пользователю в игре?**

# 5. **Что происходит, если пользователь вводит неправильное слово в функции `guess_the_word`?**

# 6. **Какая подсказка выводится первой при неправильном угадывании?**

# 7. **Какое условие завершает игру досрочно в случае успешного угадывания слова?**

# 8. **Что произойдет, если у пользователя закончились попытки, но слово не было угадано?**

# 9. **Как программа определяет, что пользователь угадал слово правильно?**

# 10. **Какие два ключа используются для хранения подсказок в словаре, возвращаемом функцией `get_word`?**
