# Задача 1: Создание словаря
# Создайте словарь, который хранит имена студентов и их возраст.

# Задача 2: Удаление элемента
# Удалите из словаря студента 

# Задача 3: Добавление элемента
# Добавьте в словарь нового студента по имени "Alex" с возрастом 15 лет.

# Задача 4: Обновление значения
# Обновите возраст студента "Anna" на 15 лет.

# Задача 5: Проверка существования ключа
# Проверьте, существует ли студент с именем "Mariya" в словаре.

# Задача 6: Перебор элементов словаря
# Выведите на экран все имена студентов и их возраст.

# Задача 7: Использование метода get
# Получите возраст студента по имени "Alex", используя метод get.

# Удалите все элементы из словаря.
# Добавьте нескольких студентов обратно в словарь.

# Подсчитайте количество студентов в словаре.

# Задание 1
# Создайте словарь с именами и возрастами ваших друзей.
# Добавьте несколько элементов в словарь и выведите его на экран.
# Измените возраст одного из друзей в словаре и выведите обновленный словарь.
# Добавьте в словарь нового друга и его возраст, затем выведите словарь на экран.
# Удалите одного друга из словаря и выведите оставшихся друзей.
# Выведите возраст одного из друзей, используя его имя в качестве ключа.
# !
# Создайте словарь с названиями и ценами фруктов. Добавьте несколько фруктов и их цены в словарь.
# Измените цену одного из фруктов в словаре и выведите обновленный словарь.
# Добавьте в словарь новый фрукт и его цену, затем выведите словарь на экран.
# Удалите один фрукт из словаря и выведите оставшиеся фрукты.
# Выведите цену одного из фруктов, используя его название в качестве ключа.

# !
# Создайте словарь с предметами и оценками. Добавьте несколько предметов и оценок.
# Измените оценку по одному из предметов в словаре и выведите обновленный словарь.
# Добавьте в словарь новый предмет и оценку, затем выведите словарь на экран.
# Удалите один предмет из словаря и выведите оставшиеся предметы.
# Выведите оценку по одному из предметов, используя его название в качестве ключа.
