
// 1. **toUppercase():**
//     - Задача: преобразовать заданную строку в верхний регистр.
//     - Пример: преобразовать строку «Привет, мир» в верхний регистр.
//     - Ожидаемый результат: «HELLO WORLD»

// 2. **toLowerCase():**
//     - Задача: преобразовать заданную строку в нижний регистр.
//     - Пример: преобразовать строку «Hello World» в нижний регистр.
//     - Ожидаемый результат: «Привет, мир»

// 3. **включает():**
//     - Задача: Проверить, содержит ли строка определенную подстроку.
//     - Пример: проверьте, содержит ли строка «банан» «нан».
//     - Ожидаемый результат: правда

// 4. **slice():**
//     - Задача: извлечь часть строки и вернуть ее как новую строку.
//     - Пример: извлеките подстроку «мир» из строки «Hello World».
//     - Ожидаемый результат: «мир»

// 5. **сплит():**
//     - Задача: Разбить строку на массив подстрок по указанному разделителю.
//     - Пример: разделите строку «яблоко,банан,апельсин» запятой.
//     - Ожидаемый результат: ["яблоко", "банан", "апельсин"]

// 6. **join():**
//     - Задача: Объединить элементы массива в одну строку с помощью заданного разделителя.
//     - Пример: объединить массив ["яблоко", "банан", "апельсин"] в строку, разделенную дефисом (-).
//     - Ожидаемый результат: «яблоко-банан-апельсин».


// 1. **toUppercase():**
//     - Задача: преобразовать заданную строку в верхний регистр.
//     - Пример: преобразовать строку «до свидания» в верхний регистр.
//     - Ожидаемый результат: «ДО СВИДАНИЯ».

// 2. **toLowerCase():**
//     - Задача: преобразовать заданную строку в нижний регистр.
//     - Пример: преобразовать строку «HELLO WORLD» в нижний регистр.
//     - Ожидаемый результат: «Привет, мир»

// 3. **включает():**
//     - Задача: Проверить, содержит ли строка определенную подстроку.
//     - Пример: проверьте, содержит ли строка «программирование» слово «грамм».
//     - Ожидаемый результат: правда

// 4. **slice():**
//     - Задача: извлечь часть строки и вернуть ее как новую строку.
//     - Пример: извлеките подстроку «быстрый» из строки «Быстрая коричневая лиса».
//     - Ожидаемый результат: «быстрый»

// 5. **сплит():**
//     - Задача: Разбить строку на массив подстрок по указанному разделителю.
//     - Пример: разделить строку «один, два, три» запятой.
//     - Ожидаемый результат: ["один", "два", "три"]

// 6. **join():**
//     - Задача: Объединить элементы массива в одну строку с помощью заданного разделителя.
//     - Пример: объединить массив ["красный", "зеленый", "синий"] в строку, разделенную пробелом.
//     - Ожидаемый результат: «красный зеленый синий»


// из сколков букв состать "HelloWorld"
// из сколков букв состать "GoodMorning"
// из сколков букв состать "GoodAfternoon"

// # Напишите слово "Hello" с маленькими буквами
// Применяем метод upperCase() для преобразования в верхний регистр

// # Напишите слово "frontend" с маленькими буквами
// Применяем метод upperCase() для преобразования в верхний регистр

// # Напишите слово "backend" с маленькими буквами
// Применяем метод upperCase() для преобразования в верхний регистр

// напишите свое имя заглавными буквами, а затем строчными
// напишите "JavaScript" заглавными буквами, а затем строчными
// существует ли в этом предложение "Hello world, "welcome to the universe"." to
// существует ли в этом предложение "The includes() method returns true if a string contains a specified string." specified
// существует ли в этом предложение "numeric characters, between two or more users " mores

// const fruits = ["Banana", "Orange", "Lemon", "Apple", "Mango"];
// сделай так чтобы здесь остались только "Orange",Lemon используй slice()
// const fruits1 = ["Banana", "Orange", "Lemon", "Apple", "Mango","PineApple","Melon"];
// сделай так чтобы здесь остались только Lemon, "Apple" используй slice()
// разделите Это предложения
// let text = "How are you doing today?";
// let text1 = "he original words and form of a written or printed work. (2) : an edited or emended copy";

// const fruitses = ["Banana", "Orange", "Apple", "Mango"];
// добавляйте && между ним
// добавляйте "And" между ним
// добавляйте "||" между ним
