
# 1. Что делает эта программа?
# 2. Какие четыре операции можно выбрать в калькуляторе?
# 3. Какую цифру нужно ввести, чтобы сложить два числа?
# 4. Как программа находит разницу между двумя числами?
# 5. Что произойдет, если ввести 5 вместо цифр от 1 до 4?
# 6. Что программа напишет, если попытаться разделить на ноль?
# 7. Какой результат выведет программа, если ввести числа 6 и 3 и выбрать умножение?
# 8. Что нужно ввести, чтобы программа выполнила деление?
# 9. Как программа проверяет, является ли введенное значение числом?
# 10. Что произойдет, если ввести не число, а слово в качестве одного из чисел?
