// ! 1
// Создайте объект student, который будет содержать следующую информацию:

// Имя (name)
// Фамилия (surname)
// Возраст (age)
// Курсы (courses) - массив с названиями курсов

// ! 2

// Создайте объект library, который будет содержать информацию о библиотеке. Объект должен содержать следующие свойства и методы:
// Свойство books - массив объектов, каждый из которых представляет книгу и содержит свойства title (название книги), author (автор книги) и year (год издания).
// Метод addBook - добавляет новую книгу в библиотеку.
// Метод getBooksByAuthor - принимает имя автора и возвращает массив книг этого автора.
// Метод getBooksByYear - принимает год и возвращает массив книг, изданных в этот год.
// Метод removeBook - принимает название книги и удаляет её из библиотеки.

// ! 3
// Создайте объект car, который будет содержать следующую информацию:
//
// Марка (brand)
// Модель (model)
// Год выпуска (year)
// Пробег (mileage)
// Тип двигателя (engineType)
// Владельцы (owners) - массив с именами владельцев
// Измените пробег автомобиля на 10,000 километров больше.
//
// Добавьте нового владельца в массив owners.
//
// Измените тип двигателя на "Гибрид".
//
// Выведите всю информацию об автомобиле в консоль.


// ! 4

// Название (title)
// Автор (author)
// Год издания (yearPublished)
// Количество страниц (pageCount)
// Жанры (genres) - массив с жанрами книги
// Читатели (readers) - массив с именами читателей
// Измените количество страниц на 50 страниц больше.

// Добавьте новый жанр в массив genres.

// Добавьте нового читателя в массив readers.

// Измените год издания на текущий год.

// Выведите всю информацию о книге в консоль.

// ! 5
// Создайте объект movie, который будет содержать следующую информацию:

// Название (title)
// Режиссер (director)
// Год выпуска (year)
// Продолжительность (duration) - в минутах
// Жанры (genres) - массив с жанрами фильма
// Актеры (actors) - массив с именами актеров
// Измените продолжительность фильма на 10 минут больше.

// Добавьте новый жанр в массив genres.

// Добавьте нового актера в массив actors.

// Измените год выпуска на текущий год.

// Выведите всю информацию о фильме в консоль.

// ! 6 
// Создайте объект product, который будет содержать следующую информацию:

// Название (name)
// Категория (category)
// Цена (price)
// Количество на складе (stock)
// Производитель (manufacturer)
// Отзывы (reviews) - массив с отзывами
// Измените цену продукта на 10% больше.

// Уменьшите количество на складе на 5 единиц.

// Добавьте новый отзыв в массив reviews.

// Измените производителя на другой.

// Выведите всю информацию о продукте в консоль.
