# Приветствие
# Попросите пользователя ввести свое имя и напишите приветственное сообщение.

# !
# Возраст
# Попросите пользователя ввести свой возраст и напишите сообщение с его возрастом.
# !
# Любимый цвет
# Попросите пользователя ввести его любимый цвет и напишите сообщение с этим цветом.
# !
# Город
# Попросите пользователя ввести город, в котором он живет, и напишите сообщение с этим городом.
# !
# Погода
# Попросите пользователя описать сегодняшнюю погоду и напишите сообщение с его описанием.
# !
# Любимый предмет
# Попросите пользователя ввести его любимый школьный предмет и напишите сообщение с этим предметом.
# !
# Имя друга
# Попросите пользователя ввести имя его лучшего друга и напишите сообщение с этим именем
# !
# Домашнее животное
# Попросите пользователя ввести вид его домашнего животного и его имя, и напишите сообщение с этой информацией
# !
# Любимая книга
# Попросите пользователя ввести название его любимой книги и напишите сообщение с этим названием.
# !
# Музыка
# Попросите пользователя ввести его любимую музыкальную группу или исполнителя и напишите сообщение с этим именем.
# !
# Фрукт
# Попросите пользователя ввести его любимый фрукт и напишите сообщение с этим фруктом.
# !
# Сладости
# Попросите пользователя ввести его любимую сладость и напишите сообщение с этой сладостью.
# !
# Страна мечты
# Попросите пользователя ввести страну, которую он хотел бы посетить, и напишите сообщение с этой страной.
# !
# Спорт
# Попросите пользователя ввести его любимый вид спорта и напишите сообщение с этим видом спорт
# !
# Игра
# Попросите пользователя ввести его любимую игру и напишите сообщение с этой игрой
# !
# Хобби
# Попросите пользователя ввести его хобби и напишите сообщение с этим хобби.
# !
# Телевизионное шоу
# Попросите пользователя ввести его любимое телевизионное шоу и напишите сообщение с этим шоу.
# !
# Праздник
# Попросите пользователя ввести его любимый праздник и напишите сообщение с этим праздником.
# !
# Месяц
# Попросите пользователя ввести его любимый месяц и напишите сообщение с этим месяцем.
# !
# Время года
# Попросите пользователя ввести его любимое время года и напишите сообщение с этим временем года.
# ! Math
# !
# Сложение двух чисел
# Попросите пользователя ввести два числа, сложите их и выведите результат.
# !
# Вычитание двух чисел
# Попросите пользователя ввести два числа, вычтите одно из другого и выведите результат.
# !
# Умножение двух чисел
# Попросите пользователя ввести два числа, умножьте их и выведите результат.
# !
# Деление двух чисел
# Попросите пользователя ввести два числа, умножьте их и выведите результат.
# !
# Остаток от деления
# Попросите пользователя ввести два числа, найдите остаток от деления одного на другое и выведите результат.

