
# 1. **Сколько игроков участвует в игре? Каковы их имена и роли?**

# 2. **Что делает функция `start_game` при вызове?**

# 3. **Какую роль выполняет функция `choose_mafia`?**

# 4. **Как программа определяет, что выбранный игрок является мафией?**

# 5. **Что происходит, если введенное имя мафии не соответствует ни одному из имен в списке `players`?**

# 6. **Как программа начинает процесс выбора жертвы мафией?**

# 7. **Что произойдет с игроком, которого мафия выбрала в качестве жертвы?**

# 8. **Что делает функция `mafia_start_to_kill` после того, как мафия выбирает жертву?**

# 9. **Как программа определяет, правильно ли граждане нашли мафию?**

# 10. **Что происходит, если граждане ошиблись и выбрали не того игрока в качестве мафии?**

# 11. **Какое сообщение выводится, если граждане правильно угадали мафию?**

# 12. **Что происходит, если игрок с именем, выбранным как мафия, не найден в списке `players`?**

# 13. **Какие действия выполняет программа после того, как мафия убивает жертву?**

# 14. **Что делает функция `find_mafia`?**

# 15. **Какой вопрос задается гражданам после того, как мафия убивает жертву?**

# 16. **Какое сообщение выводится, если граждане неверно определили мафию и выбрали гражданина?**

# 17. **Что делает функция `stop_game`?**

# 18. **Как программа начинает игру? Какой первой функцией она пользуется?**

# 19. **Что происходит, если в процессе игры остается только один игрок?**

# 20. **Как программа управляет процессом голосования граждан на определение мафии?**
