// ! Task
//? 1. Запрашиваем строку у пользователя
//? 2. Вычисляем длину строки
//? 3. Выводим сообщение с длиной строки
// ! Task
//? Выведите длину исходной строки.
// let text = "Привет, мир!";
// ! Task
//? Выведите исходную строку в верхнем регистре(верхнем регистре).()me ghula arfen qate zewesto
// ?Выведите исходную строку в нижнем регистре.
// ! Task
//? Выведите исходную строку с удаленными пробелами с начала и конца.
// ! Task
//? Определите длину строки "Привет, мир!"
// ! Task
//? Извлеките подстроку "мир" из строки "Привет, мир!"
// ! Task
// ? Преобразуйте строку "Привет, мир!" в верхний регистр
// ! Task
//? Преобразуйте строку "Привет, мир!" в нижний регистр
// ! Task
//? Удалите пробелы с начала и конца строки "   Привет, мир!   "
// ! Task
//? Разделите строку "Привет, мир! Как дела?" по пробелам
// ! Task
// ? Получите первый элемент из строки, разделенной запятыми: "Яблоки, Бананы, Апельсины"
// ! Task
// ! Task
// ! Task


