// Создайте объект course, который будет содержать следующую информацию:

// Название курса (title)
// Преподаватель (teacher)
// Количество уроков (lessonCount)
// Учащиеся (students) - массив объектов, где каждый объект представляет учащегося и содержит свойства:
// Имя (name)
// Возраст (age)
// Оценки (grades) - массив оценок за задания
// Темы (topics) - массив тем, которые будут изучаться на курсе
// Добавьте нового учащегося в массив students с именем "Анна Иванова", возрастом 20 и пустым массивом оценок.

// Добавьте новый урок в массив topics.

// Измените количество уроков на количество элементов в массиве topics.

// Удалите самого младшего учащегося из массива students.

// Добавьте новую оценку 85 для каждого учащегося.

// Выведите всю информацию о курсе в консоль, включая имена учащихся и их средние оценки.