// !
// Используя цикл for, пройдитесь по числам от 1 до 10.
// В каждой итерации выведите текущее число в консоль.
// !
// Создайте переменную i и присвойте ей начальное значение 10.
// Используйте цикл while, чтобы уменьшать значение i на 1 в каждой итерации.
// В каждой итерации выведите текущее значение i в консоль.
// !
// Создайте переменную sum и присвойте ей начальное значение 0.
// Используйте цикл for, пройдитесь по числам от 1 до 10.
// В каждой итерации проверяйте, является ли текущее число четным.
// Если число четное, добавляйте его к переменной sum.
// В конце цикла выведите значение переменной sum в консоль.
// !
// Создайте переменную count и присвойте ей начальное значение 0.
// Используйте цикл while, чтобы повторять вывод строки, пока count меньше 5.
// В каждой итерации увеличивайте значение count на 1.
// !
// Используйте цикл for, пройдитесь по числам от 20 до 10.
// В каждой итерации уменьшайте значение на 1.
// В каждой итерации выведите текущее число в консоль.
// !
// Используйте цикл for, пройдитесь по числам от 1 до 15.
// В каждой итерации проверяйте, является ли текущее число нечетным.
// Если число нечетное, выведите его в консоль.
// !
// !
// Создайте переменную sum и присвойте ей начальное значение 0.
// Используя цикл for, пройдитесь по числам от 1 до 100.
// В каждой итерации добавляйте текущее число к переменной sum.
// Выведите результат в консоль.
// !
// Создайте переменную n и присвойте ей значение, например, 5.
// Создайте переменную factorial и присвойте ей начальное значение 1.
// Используйте цикл while, чтобы вычислить факториал числа n.
// Выведите результат в консоль.

// !
// Используя цикл for, пройдитесь по числам от 1 до 50.
// В каждой итерации проверяйте, является ли текущее число четным.
// Если число четное, выведите его в консоль.

// !
// Создайте переменную sum и присвойте ей начальное значение 0.
// Создайте переменную i и присвойте ей начальное значение 1.
// Используйте цикл while, чтобы добавлять значение i к sum до тех пор, пока sum не станет больше 1000.
// В каждой итерации увеличивайте значение i на 1.
// Выведите результат в консоль.

// !
// Создайте два начальных числа последовательности: a = 0 и b = 1.
// Используйте цикл for для генерации следующих чисел последовательности.
// В каждой итерации выведите текущее значение a и обновите значения a и b для следующей итерации.
