
# 1. **Задание:** Запросить у пользователя число `n` и напечатать все числа от 1 до `n`.

# 2. **Задание:** Запросить у пользователя строку и напечатать каждый символ этой строки.

# 3. **Задание:** Запросить у пользователя число `n` и напечатать строку 'Привет' `n` раз.

# 4. **Задание:** Запросить у пользователя два числа `a` и `b` и напечатать все числа от `a` до `b`.

# 5. **Задание:** Запросить у пользователя слово и напечатать его 3 раза.

# 6. **Задание:** Запросить у пользователя строку и напечатать каждый ее символ в верхнем регистре.

# 7. **Задание:** Запросить у пользователя число `n` и напечатать все четные числа от 1 до `n`.

# 8. **Задание:** Запросить у пользователя число `n` и напечатать строку 'Python' `n` раз.

# 9. **Задание:** Запросить у пользователя строку и напечатать каждый второй символ этой строки.

# 10. **Задание:** Запросить у пользователя число `n` и напечатать все числа от `n` до 1 в обратном порядке.

# 11. **Задание:** Запросить у пользователя строку и напечатать все гласные буквы в этой строке.

# 12. **Задание:** Запросить у пользователя число `n` и напечатать все числа от 1 до `n`, которые делятся на 3.

# 13. **Задание:** Запросить у пользователя два числа `a` и `b` и напечатать все нечетные числа от `a` до `b`.

# 14. **Задание:** Запросить у пользователя строку и напечатать каждый символ этой строки с индексом.

# 15. **Задание:** Запросить у пользователя число `n` и напечатать все числа от 1 до `n`, которые делятся на 5.

# 16. **Задание:** Запросить у пользователя строку и напечатать все согласные буквы в этой строке.

# 17. **Задание:** Запросить у пользователя число `n` и напечатать строку 'Кодинг' `n` раз.

# 18. **Задание:** Запросить у пользователя строку и напечатать все цифры в этой строке.

# 19. **Задание:** Запросить у пользователя два числа `a` и `b` и напечатать все числа от `a` до `b`, которые делятся на 2.

# 20. **Задание:** Запросить у пользователя строку и напечатать каждый символ этой строки в обратном порядке.