# ! Приветствие
# Попросите пользователя ввести свое имя и напишите приветственное сообщение.
name = input("Введите свое имя: ")
print("Привет, " + name + "!")

# Возраст
# Попросите пользователя ввести свой возраст и напишите сообщение с его возрастом.
age = input("Введите свой возраст: ")
print("Ваш возраст: " + age)

# Любимый цвет
# Попросите пользователя ввести его любимый цвет и напишите сообщение с этим цветом.
color = input("Введите ваш любимый цвет: ")
print("Ваш любимый цвет: " + color)

# Город
# Попросите пользователя ввести город, в котором он живет, и напишите сообщение с этим городом.
city = input("Введите ваш город: ")
print("Вы живете в городе: " + city)

# Погода
# Попросите пользователя описать сегодняшнюю погоду и напишите сообщение с его описанием.
weather = input("Опишите сегодняшнюю погоду: ")
print("Сегодня погода: " + weather)

# Любимый предмет
# Попросите пользователя ввести его любимый школьный предмет и напишите сообщение с этим предметом.
think = input("Введите ваш любимый школьный предмет: ")
print("Ваш любимый предмет: " + think)

# Имя друга
# Попросите пользователя ввести имя его лучшего друга и напишите сообщение с этим именем.
freind = input("Введите имя вашего лучшего друга: ")
print("Ваш лучший друг: " + freind)

# Домашнее животное
# Попросите пользователя ввести вид его домашнего животного и его имя, и напишите сообщение с этой информацией.
animals = input("Какое у вас домашнее животное? ")
animalsName = input("Как зовут вашего питомца? ")
print("У вас есть " + animals + ", его зовут " + animalsName)

# Любимая книга
# Попросите пользователя ввести название его любимой книги и напишите сообщение с этим названием.
book = input("Введите название вашей любимой книги: ")
print("Ваша любимая книга: " + book)

# Музыка
# Попросите пользователя ввести его любимую музыкальную группу или исполнителя и напишите сообщение с этим именем.
music = input("Введите вашу любимую музыкальную группу или исполнителя: ")
print("Ваш любимый исполнитель: " + music)

# Фрукт
# Попросите пользователя ввести его любимый фрукт и напишите сообщение с этим фруктом.
fruits = input("Введите ваш любимый фрукт: ")
print("Ваш любимый фрукт: " + fruits)

# Сладости
# Попросите пользователя ввести его любимую сладость и напишите сообщение с этой сладостью.
candy = input("Введите вашу любимую сладость: ")
print("Ваша любимая сладость: " + candy)

# Страна мечты
# Попросите пользователя ввести страну, которую он хотел бы посетить, и напишите сообщение с этой страной.
country = input("Введите страну, которую вы хотели бы посетить: ")
print("Вы хотите посетить: " + country)

# Спорт
# Попросите пользователя ввести его любимый вид спорта и напишите сообщение с этим видом спорта.
sport = input("Введите ваш любимый вид спорта: ")
print("Ваш любимый вид спорта: " + sport)

# Игра
# Попросите пользователя ввести его любимую игру и напишите сообщение с этой игрой
game = input("Введите вашу любимую игру: ")
print("Ваша любимая игра: " + game)

# Хобби
# Попросите пользователя ввести его хобби и напишите сообщение с этим хобби.
hobby = input("Введите ваше хобби: ")
print("Ваше хобби: " + hobby)

# Телевизионное шоу
# Попросите пользователя ввести его любимое телевизионное шоу и напишите сообщение с этим шоу.
shoy = input("Введите ваше любимое телевизионное шоу: ")
print("Ваше любимое шоу: " + shoy)

# Праздник
# Попросите пользователя ввести его любимый праздник и напишите сообщение с этим праздником.
holiday = input("Введите ваш любимый праздник: ")
print("Ваш любимый праздник: " + holiday)

# Месяц
# Попросите пользователя ввести его любимый месяц и напишите сообщение с этим месяцем.
month = input("Введите ваш любимый месяц: ")
print("Ваш любимый месяц: " + month)

# Время года
# Попросите пользователя ввести его любимое время года и напишите сообщение с этим временем года.
year = input("Введите ваше любимое время года: ")
print("Ваше любимое время года: " + year)



# ! Math
# Сложение двух чисел
# Попросите пользователя ввести два числа, сложите их и выведите результат.
number1 = input("Введите первое число: ")
number2 = input("Введите второе число: ")
sum = int(number1) + int(number2)
print("Сумма чисел: " + str(sum))

# Вычитание двух чисел
# Попросите пользователя ввести два числа, вычтите одно из другого и выведите результат.
number3 = input("Введите первое число: ")
number4 = input("Введите второе число: ")
difference = int(number3) - int(number4)
print("Разность чисел: " + str(difference))

# Умножение двух чисел
# Попросите пользователя ввести два числа, умножьте их и выведите результат.
number5 = input("Введите первое число: ")
number6 = input("Введите второе число: ")
work = int(number5) * int(number6)
print("Произведение чисел: " + str(work))
# Деление двух чисел
# Попросите пользователя ввести два числа, умножьте их и выведите результат.
number7 = input("Введите первое число: ")
number8 = input("Введите второе число: ")
private = int(number7) * int(number8)
print("Произведение чисел: " + str(private))

# Остаток от деления
# Попросите пользователя ввести два числа, найдите остаток от деления одного на другое и выведите результат.
number9 = input("Введите первое число: ")
number10 = input("Введите второе число: ")
remainder = int(number9) % int(number10)
print("Остаток от деления: " + str(remainder))



